Revit 2026 API
FormUtils Class
 Define Form utility functions
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FormUtils
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public static class FormUtils
Public NotInheritable Class FormUtils
public ref class FormUtils abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type FormUtils = class end
The FormUtils type exposes the following members.
Methods
Name | Description
CanBeDissolved
DissolveForms(Document, ICollection<ElementId>)
DissolveForms(Document, ICollection<ElementId>, ICollection<ElementId>)
Top
See Also
Reference
Autodesk.Revit.DB Namespace